Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/code-splitting_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: code-splitting title: Code-Splitting permalink: docs/code-splitting.html ---
ja: --- id: code-splitting title: コード分割 permalink: docs/code-splitting.html ---

source: ## Bundling {#bundling}
ja: ## バンドル {#bundling}

source: Most React apps will have their files "bundled" using tools like [Webpack](https://webpack.js.org/), [Rollup](https://rollupjs.org/) or [Browserify](http://browserify.org/).
ja: 多くの React アプリケーションは、[Webpack](https://webpack.js.org/)、[Rollup](https://rollupjs.org/) や [Browserify](http://browserify.org/) などのツールを使ってファイルを「バンドル」しています。

source: Bundling is the process of following imported files and merging them into a single file: a "bundle".
ja: バンドルはインポートされたファイルをたどって、それらを 1 つのファイルにまとめるプロセスです。

source: This bundle can then be included on a webpage to load an entire app at once.
ja: このバンドルされたファイルを Web ページ内に置くことによって、アプリ全体を一度に読み込むことができます。

source: #### Example {#example}
ja: #### 例 {#example}

source: > Note: > > Your bundles will end up looking a lot different than this.
ja: > 補足： > > 実際のバンドルはこれとは大幅に異なった見た目になります。

source: If you're using [Create React App](https://create-react-app.dev/), [Next.js](https://nextjs.org/), [Gatsby](https://www.gatsbyjs.org/), or a similar tool, you will have a Webpack setup out of the box to bundle your app.
ja: もし [Create React App](https://create-react-app.dev/)、[Next.js](https://nextjs.org/)、[Gatsby](https://www.gatsbyjs.org/) やこれらに類するツールを使用している場合、アプリケーションをバンドルするための Webpack のセットアップが最初から含まれています。

source: If you aren't, you'll need to set up bundling yourself.
ja: そうでない場合は、自分でバンドルを設定する必要があります。

source: For example, see the [Installation](https://webpack.js.org/guides/installation/) and [Getting Started](https://webpack.js.org/guides/getting-started/) guides on the Webpack docs.
ja: 設定方法に関しては、Webpack のドキュメントにある [Installation](https://webpack.js.org/guides/installation/) や [Getting Started](https://webpack.js.org/guides/getting-started/) などを参照してみてください。

source: ## Code Splitting {#code-splitting}
ja: ## コード分割 {#code-splitting}

source: Bundling is great, but as your app grows, your bundle will grow too.
ja: バンドルは確かに素晴らしいですが、アプリが大きくなるにつれて、バンドルのサイズも大きくなります。

source: Especially if you are including large third-party libraries.
ja: 特にサイズの大きなサードパーティ製のライブラリを含む場合は顕著にサイズが増大します。

source: You need to keep an eye on the code you are including in your bundle so that you don't accidentally make it so large that your app takes a long time to load.
ja: 不用意に大きなバンドルを作成してしまいアプリの読み込みに多くの時間がかかってしまうという事態にならないためにも、常に注意を払い続けなければなりません。

source: To avoid winding up with a large bundle, it's good to get ahead of the problem and start "splitting" your bundle.
ja: 大きなバンドルを不注意に生成してしまわないように、あらかじめコードを「分割」して問題を回避しましょう。

source: Code-Splitting is a feature supported by bundlers like [Webpack](https://webpack.js.org/guides/code-splitting/), [Rollup](https://rollupjs.org/guide/en/#code-splitting) and Browserify (via [factor-bundle](https://github.com/browserify/factor-bundle)) which can create multiple bundles that can be dynamically loaded at runtime.
ja: Code-Splitting は、[Webpack](https://webpack.js.org/guides/code-splitting/)、[Rollup](https://rollupjs.org/guide/en/#code-splitting) や Browserify（[factor-bundle](https://github.com/browserify/factor-bundle) を使用）などのバンドラによってサポートされている機能であり、実行時に動的にロードされる複数のバンドルを生成することができます。

source: Code-splitting your app can help you "lazy-load" just the things that are currently needed by the user, which can dramatically improve the performance of your app.
ja: コード分割は、ユーザが必要とするコードだけを「遅延読み込み」する手助けとなり、アプリのパフォーマンスを劇的に向上させることができます。

source: While you haven't reduced the overall amount of code in your app, you've avoided loading code that the user may never need, and reduced the amount of code needed during the initial load.
ja: アプリの全体的なコード量を減らすことはできませんが、ユーザが必要としないコードを読み込まなくて済むため、初期ロードの際に読む込むコード量を削減できます。

source: The best way to introduce code-splitting into your app is through the dynamic `import()` syntax.
ja: コード分割をアプリに導入する最も良い手段は動的な `import()` 構文を使用することです。

source: When Webpack comes across this syntax, it automatically starts code-splitting your app.
ja: Webpack がこの構文を見つけると、自動的にアプリのコードを分割します。

source: If you're using Create React App, this is already configured for you and you can [start using it](https://create-react-app.dev/docs/code-splitting/) immediately.
ja: Create React App を使用している場合はすでに設定がされているため、[すぐに使用を開始することができます](https://facebook.github.io/create-react-app/docs/code-splitting)。

source: It's also supported out of the box in [Next.js](https://nextjs.org/docs/advanced-features/dynamic-import).
ja: [Next.js](https://nextjs.org/docs/advanced-features/dynamic-import) も同様です。

source: If you're setting up Webpack yourself, you'll probably want to read Webpack's [guide on code splitting](https://webpack.js.org/guides/code-splitting/).
ja: もし Webpack を自分でセットアップしていた場合には、Webpack の[コード分割に関するガイド](https://webpack.js.org/guides/code-splitting/)を読むと良いでしょう。

source: Your Webpack config should look vaguely [like this](https://gist.github.com/gaearon/ca6e803f5c604d37468b0091d9959269).
ja: あなたの Webpack の設定はだいたい[このように](https://gist.github.com/gaearon/ca6e803f5c604d37468b0091d9959269)なると思います。

source: When using [Babel](https://babeljs.io/), you'll need to make sure that Babel can parse the dynamic import syntax but is not transforming it.
ja: もし [Babel](https://babeljs.io/) を使用している場合は、Babel が動的インポート構文をパースできても変換してしまわないようにする必要があります。

source: For that you will need [@babel/plugin-syntax-dynamic-import](https://classic.yarnpkg.com/en/package/@babel/plugin-syntax-dynamic-import).
ja: そのためには [babel-plugin-syntax-dynamic-import](https://yarnpkg.com/en/package/babel-plugin-syntax-dynamic-import) を利用すると良いでしょう。

source: > Note: > > `React.lazy` and Suspense are not yet available for server-side rendering.
ja: > 補足: > > `React.lazy` と Suspense はまだサーバサイドレンダリングには使用できません。

source: If you want to do code-splitting in a server rendered app, we recommend [Loadable Components](https://github.com/gregberge/loadable-components).
ja: サーバサイドでレンダリングされたアプリでコード分割をしたい場合には、[Loadable Components](https://github.com/gregberge/loadable-components) の使用をおすすめします。

source: It has a nice [guide for bundle splitting with server-side rendering](https://loadable-components.com/docs/server-side-rendering/).
ja: [サーバサイドレンダリングでのバンドル分割のための素晴らしいガイド](https://loadable-components.com/docs/server-side-rendering/)も提供されているので、参考にしてみてください。

source: The `React.lazy` function lets you render a dynamic import as a regular component.
ja: `React.lazy` 関数を使用すると、動的インポートを通常のコンポーネントとしてレンダーすることができます。

source: This will automatically load the bundle containing the `OtherComponent` when this component is first rendered.
ja: このコンポーネントがはじめてレンダーされる時、`OtherComponent` を含むバンドルを自動的にロードしてくれます。

source: `React.lazy` takes a function that must call a dynamic `import()`.
ja: `React.lazy` は動的インポート構文 `import()` を呼び出す関数を引数として取ります。

source: This must return a `Promise` which resolves to a module with a `default` export containing a React component.
ja: この関数は React コンポーネントを含む `default` export を持つモジュールに解決される `Promise` を返さなければなりません。

source: The lazy component should then be rendered inside a `Suspense` component, which allows us to show some fallback content (such as a loading indicator) while we're waiting for the lazy component to load.
ja: 遅延コンポーネントは、`Suspense` コンポーネント内でレンダーされる必要があります。これによって、遅延コンポーネントのローディングの待機中にフォールバック用のコンテンツ（ローディングインジケータなど）を表示できます。

source: The `fallback` prop accepts any React elements that you want to render while waiting for the component to load.
ja: `fallback` プロパティはコンポーネントがロードされるのを待っている間に表示したいあらゆる React 要素を受け取ります。

source: You can place the `Suspense` component anywhere above the lazy component.
ja: `Suspense` コンポーネントは遅延コンポーネントより上位のどこにでも配置することができます。

source: You can even wrap multiple lazy components with a single `Suspense` component.
ja: また、複数の遅延コンポーネントを単一の `Suspense` コンポーネントでラップすることもできます。

source: ### Error boundaries {#error-boundaries}
ja: ### Error Boundary {#error-boundaries}

source: If the other module fails to load (for example, due to network failure), it will trigger an error.
ja: もし他のモジュールがロードに失敗した場合（例えば、ネットワークの障害など）、エラーが発生します。

source: You can handle these errors to show a nice user experience and manage recovery with [Error Boundaries](/docs/error-boundaries.html).
ja: その際には [error boundary](/docs/error-boundaries.html) を使用することによってこれらのエラーをハンドリングし、エラーの回復やユーザ体験の向上に繋げることができます。

source: Once you've created your Error Boundary, you can use it anywhere above your lazy components to display an error state when there's a network error.
ja: error boundary を作成したら、遅延コンポーネントより上位のあらゆる場所で使用でき、ネットワークエラーが発生した際にエラー内容を表示することができます。

source: ## Route-based code splitting {#route-based-code-splitting}
ja: ## ルーティング単位でのコード分割 {#route-based-code-splitting}

source: Deciding where in your app to introduce code splitting can be a bit tricky.
ja: アプリ内のどこにコード分割を導入するかを決めるのは少し面倒です。

source: You want to make sure you choose places that will split bundles evenly, but won't disrupt the user experience.
ja: バンドルを均等に分割する場所を確実に選択したいところですが、ユーザ体験を妨げてはなりません。

source: A good place to start is with routes.
ja: コード分割を導入するにあたって適している場所はルーティングです。

source: Most people on the web are used to page transitions taking some amount of time to load.
ja: Web を使用するほとんどの人は、多少のロード時間がかかるページ遷移に慣れています。

source: You also tend to be re-rendering the entire page at once so your users are unlikely to be interacting with other elements on the page at the same time.
ja: また、ユーザがページ上の他の要素を同時に操作する可能性を減らすよう、ページ全体を一度に再レンダーすることが多いでしょう。

source: Here's an example of how to setup route-based code splitting into your app using libraries like [React Router](https://reacttraining.com/react-router/) with `React.lazy`.
ja: これは [React Router](https://reacttraining.com/react-router/) のようなライブラリを使ったアプリに `React.lazy` を使用することでルーティングベースのコード分割を導入する方法の例です。

source: ## Named Exports {#named-exports}
ja: ## 名前付きエクスポート {#named-exports}

source: `React.lazy` currently only supports default exports.
ja: `React.lazy` は現在デフォルトエクスポートのみサポートしています。

source: If the module you want to import uses named exports, you can create an intermediate module that reexports it as the default.
ja: インポートしたいモジュールが名前付きエクスポートを使用している場合、それをデフォルトとして再エクスポートする中間モジュールを作成できます。

source: This ensures that tree shaking keeps working and that you don't pull in unused components.
ja: これにより、tree shaking が機能し未使用のコンポーネントを取り込まず済むようにできます。
